app/controllers/foos_controller.rb

  def index
    @foos = Foo.all
---
SELECT "foos".* FROM "foos"