app/controllers/grupos_controller.rb

  def index
    @grupos = Grupo.all
---
SELECT "grupos".* FROM "grupos"

  def set_grupo
    @grupo = Grupo.find(params[:id])
---
SELECT  "grupos".* FROM "grupos" WHERE "grupos"."id" = $1 LIMIT 1  [["id", 1]]