app/controllers/igrejas_controller.rb

  def index
    @tela = 'Listar Igreja'

    @igreja = Igreja.new

    @igrejas = Igreja.none

    if current_user.tem_permissao ['usuarioPodeAcessarTodosOsNiveisDaIgreja']
      @igrejas = Igreja.where(id: current_user.igrejas_ids)
    else
      membro = Membro.find_by_user_id(current_user.id)

      unless membro.nil?
        @igrejas = Igreja.where(id: membro.igrejas_ids)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]