app/controllers/igrejas_controller.rb

INSERT INTO "enderecos" ("logradouro", "numero", "complemento", "cep", "igreja_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["logradouro", "1"], ["numero", "1"], ["complemento", "1"], ["cep", "1"], ["igreja_id", 2], ["created_at", "2015-10-29 02:27:06.079288"], ["updated_at", "2015-10-29 02:27:06.079288"]]
INSERT INTO "igrejas" ("descricao", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["descricao", "Teste"], ["created_at", "2015-10-27 17:10:22.005267"], ["updated_at", "2015-10-27 17:10:22.005267"]]
---
  def create

    @igreja = Igreja.new(igreja_params)

    @estados = Estado.order('nome')
    @cidades = Cidade.where("estado_id = ?", @igreja.enderecos[0].cidade.estado.id).order("nome")

    respond_to do |format|
      if @igreja.save

SELECT  "igrejas".* FROM "igrejas" WHERE "igrejas"."id" = $1 LIMIT 1  [["id", 1]]
---
  def set_igreja
    @igreja = Igreja.find(params[:id])